console.log(`1. Вёрстка валидная +10
2. Вёрстка семантическая +20
    2.1 <header>, <main>, <footer> +3
    2.2 четыре элемента <section> (по количеству секций) +3
    2.3 только один заголовок <h1> +3
    2.4 один элемент <nav> (панель навигации) +3
    2.5 два списка ul > li > a (панель навигации, ссылки на соцсети) +3
    2.6 четыре кнопки <button> +2
3. Вёрстка соответствует макету +48 (!Мог что-то упустить!, но визуально точность до 10px.)
    3.1 блок <header> +6
    3.2 секция preview +9
    3.3 секция steps +9
    3.4 секция destinations +9
    3.5 секция stories +9
    3.6 блок <footer> +6
4. Требования к css + 12
    4.1 для построения сетки используются флексы или гриды +2
    4.2 при уменьшении масштаба страницы браузера вёрстка размещается по центру, а не сдвигается в сторону +2
    4.3 фоновый цвет тянется на всю ширину страницы +2
    4.4 иконки добавлены в формате .svg. SVG может быть добавлен любым способом. Обращаем внимание на формат, а не на способ добавления +2
    4.5 изображения добавлены в формате .jpg +2
    4.6 есть favicon +2
5. Интерактивность, реализуемая через css +20
    5.1 плавная прокрутка по якорям +5
    5.2 иконки соцсетей в футере при нажатии на них ведут на гитхаб автора проекта и на страницу курса +5
    5.3 интерактивность включает в себя не только изменение внешнего вида курсора, но и другие визуальные эффекты(применено для кнопок) +5
    5.4 обязательное требование к интерактивности: плавное изменение внешнего вида элемента при наведении и клике не влияющее на соседние элементы +5

100/100
`);
